[
  {
    "news_id": "1",
    "datePosted": "Feb 11, 2014",
    "description": "Vision Academy Hosts Annual Science Fair Promoting Innovation and Critical Thinking Vision Academy recently organized its annual Science Fair, providing students with a platform to showcase their scientific knowledge and innovation. Students presented a wide range of projects, from physics experiments to biology research, highlighting their critical thinking skills and problem-solving abilities."
  },
  {
    "news_id": "2",
    "datePosted": "June 13, 2014",
    "description": "Collaboration between Vision Academy and Parents Empowers Student Success Recognizing the importance of parental involvement in education, Vision Academy continues to foster strong partnerships with parents. Through regular communication, parent-teacher conferences, and collaborative initiatives, the school ensures that parents play an active role in supporting their child's academic journey and overall well-being."
  },
  {
    "news_id": "3",
    "datePosted": "Jan 09, 2015",
    "description": "Vision Academy Launches School-Wide Writing Competition to Promote Creativity In an effort to nurture students' writing skills and foster creativity, Vision Academy recently initiated a school-wide writing competition. Students from all grade levels were encouraged to participate and express their ideas through various genres, such as poetry, short stories, and persuasive essays, inspiring a love for writing among the student body."
  },
  {
    "news_id": "4",
    "datePosted": "Oct 2016",
    "description": "Vision Academy Students Engage in Meaningful Social Work Projects Instilling a sense of social responsibility, Vision Academy encourages students to actively engage in community service and social work. Students have participated in initiatives such as organizing donation drives, volunteering at local shelters, and conducting awareness campaigns, promoting empathy and compassion within the student community."
  },
  {
    "news_id": "5",
    "datePosted": "March 2018",
    "description": "Vision Academy Recognizes Academic Excellence with Annual Awards Ceremony Each year, Vision Academy celebrates academic achievements through its highly anticipated Annual Awards Ceremony. Students who have demonstrated outstanding performance in various subjects, as well as exceptional growth and improvement, are recognized and honored for their dedication and hard work."
  },
  {
    "news_id": "6",
    "datePosted": "May 2019",
    "description": "Vision Academy Organizes Career Fair to Broaden Students' Horizons In an effort to expose students to a wide range of career opportunities, Vision Academy recently hosted a Career Fair. Professionals from various fields were invited to share their expertise and experiences, enabling students to explore potential career paths, ask questions, and gain valuable insights into different industries."
  },
  {
    "news_id": "7",
    "datePosted": "February 8, 2020",
    "description": "Vision Academy Launches Environmental Awareness Campaign Taking a proactive stance towards environmental sustainability, Vision Academy initiated an environmental awareness campaign. Students participated in activities such as tree planting, waste management initiatives, and educational workshops, aiming to raise awareness about environmental issues and inspire sustainable practices within the school and local community."
  },
  {
    "news_id": "8",
    "datePosted": "December 11, 2020",
    "description": "Vision Academy Students Volunteer at Local Hospitals and Nursing Homes As part of their commitment to community engagement, Vision Academy students actively volunteer at local hospitals and nursing homes. Through this initiative, students have the opportunity to bring joy and companionship to the elderly, assist healthcare professionals, and gain a deeper appreciation for the value of compassion and service to others."
  },
  {
    "news_id": "9",
    "datePosted": "November 23, 2021",
    "description": "Vision Academy Celebrates Cultural Diversity with International Day Embracing the richness of Ethiopia's cultural diversity, Vision Academy organized an International Day celebration. Students and staff members showcased their cultural heritage through performances, traditional attire, and culinary delights. The event fostered cultural appreciation and promoted a sense of unity among the diverse student body."
  },
  {
    "news_id": "10",
    "datePosted": "July 29, 2022",
    "description": "Vision Academy Launches Entrepreneurship Program to Foster Innovative Thinking In line with its commitment to preparing students for the ever-changing world, Vision Academy introduced an entrepreneurship program. This initiative aims to cultivate innovative thinking, creativity, and business acumen among students. Through workshops, mentorship, and practical projects, students learn to develop and pitch their entrepreneurial ideas, fostering a spirit of innovation and leadership."
  },
  {
    "news_id": "11",
    "datePosted": "Sept 10, 2022",
    "description": "Vision Academy Partners with Local Organizations to Enhance Career Development Opportunities Recognizing the importance of preparing students for future career paths, Vision Academy forged partnerships with local organizations. These collaborations provide students with internships, mentoring programs, and workshops, enabling them to gain practical experience and insights into various professions. The school's efforts aim to equip students with the skills and knowledge necessary for successful careers."
  },
  {
    "news_id": "12",
    "datePosted": "Jan 13, 2023",
    "description": "Vision Academy Launches Wellness Program to Support Student Well-being Prioritizing the holistic development of students, Vision Academy introduced a comprehensive wellness program. The program incorporates mindfulness activities, stress management workshops, and physical fitness initiatives. By promoting mental, emotional, and physical well-being, the school aims to create a supportive environment that empowers students to thrive academically and personally."
  },
  {
    "news_id": "13",
    "datePosted": "May 10, 2023",
    "description": "Vision Academy Students Excel in National Mathematics Olympiad Vision Academy students showcased their mathematical prowess by achieving exceptional results in the National Mathematics Olympiad. Several students received top honors, with their strong problem-solving skills and analytical thinking recognized at the national level. The school takes pride in nurturing students' mathematical abilities and promoting a culture of academic excellence."
  }
]
